In [1]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt

In [2]:
# 데이터 읽기
titanic_data = pd.read_csv("data-files/titanic-train.csv", encoding="utf-8")

In [3]:
# 요약 정보 보기
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
# 컬럼(속성)별로 결측치 (missing value) 확인
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
print( titanic_data.shape[0] ) # 행(관측치)의 개수
titanic_data.isnull().sum() / titanic_data.shape[0]

891

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [11]:
# 결측치 처리 1 : 열삭제
titanic_data.drop("Cabin", axis=1, inplace=True)

In [12]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [17]:
# 결측치 처리 2 : 행삭제
boolean_indexer = ~titanic_data["Embarked"].isnull()
titanic_data = titanic_data[boolean_indexer]

In [18]:
titanic_data.shape

(889, 11)

In [26]:
# meanv = titanic_data["Age"].mean()
# medianv = titanic_data["Age"].median()
# maxv = titanic_data["Age"].max()
# minv = titanic_data["Age"].min()
# meanv, medianv, maxv, minv

subv = titanic_data["Age"].agg([np.mean, np.median, np.max, np.min])
subv

mean      29.642093
median    29.642093
amax      80.000000
amin       0.420000
Name: Age, dtype: float64

In [21]:
# 결측치 처리 3 : 대체값 사용
subv = titanic_data["Age"].agg([np.mean, np.median])

titanic_data["Age"].fillna(subv['mean'], inplace=True)

In [22]:
titanic_data['Age'].isna().sum()

0

In [23]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 83.3+ KB

In [33]:
# index 초기화
# titanic_data.reset_index() # 원래 인덱스 데이터를 일반 컬럼으로 이동
titanic_data.reset_index(drop=True, inplace=True) # drop=True : 원래 인덱스 데이터는 제거

In [35]:
titanic_data.index
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.5+ KB

In [39]:
# 불필요한 컬럼 제거
titanic_data.drop(['PassengerId', 'Ticket'], axis=1, inplace=True)

In [40]:
titanic_data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [45]:
# (분석에 효과적인) 새로운 컬럼 추가
titanic_data["Parch"] + titanic_data["SibSp"]
titanic_data[['Parch', "SibSp"]].sum(axis=1)

# titanic_data["FamilySize"] = titanic_data["Parch"] + titanic_data["SibSp"]
titanic_data["FamilySize"] = titanic_data[['Parch', "SibSp"]].sum(axis=1)

In [46]:
titanic_data['FamilySize']

0      1
1      1
2      0
3      1
4      0
      ..
884    0
885    0
886    3
887    0
888    0
Name: FamilySize, Length: 889, dtype: int64

In [47]:
# 불필요한 컬럼 제거
titanic_data.drop(["Parch", "SibSp"], axis=1, inplace=True)

In [48]:
titanic_data.head()

,Survived,Pclass,Name,Sex,Age,Fare,Embarked,FamilySize
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,S,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C,1
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S,1
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,S,0

In [53]:
# Pclass별 생존 데이터

titanic_data['Pclass'].unique() # unique : 컬럼의 값을 중복을 제거하고 반환
titanic_data['Pclass'].value_counts() # 각 값별로 개수를 반환

titanic_data.groupby("Pclass")["Survived"].sum() # Pclass 별로 Survived의 합계 계산
titanic_data.groupby("Pclass")["Survived"].mean() # Pclass 별로 Survived의 평균 계산 (생존률)

Pclass
1    0.626168
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [56]:
# 성별 생존 데이터
titanic_data['Sex'].value_counts()
titanic_data.groupby('Sex')["Survived"].count()

titanic_data.groupby('Sex')["Survived"].mean()

Sex
female    0.740385
male      0.188908
Name: Survived, dtype: float64

In [61]:
# 나이별 생존 데이터
titanic_data.groupby("Age")["Survived"].mean()

# pd.cut : 범주를 나누고 각 데이터에 해당하는 범주 할당
age_group = pd.cut(titanic_data["Age"], bins=[0, 15, 50, 200], labels=["child", "adult", "elder"])
titanic_data["AgeGroup"] = age_group

titanic_data.groupby("AgeGroup")["Survived"].mean()

AgeGroup
child    0.590361
adult    0.363392
elder    0.333333
Name: Survived, dtype: float64